
var dailyInfo = [
    "Рослини мають власний спосіб \"спілкування\": Деякі рослини можуть відповідати на зовнішні подразники, такі як торкання або пошкодження, видаючи хімічні речовини або змінюючи свою структуру для захисту",
"Найбільший рослинний орган на Землі: Дерево-секвоя, відоме як \"Генерал Шерман\", вважається найбільшим рослинним організмом на планеті за об'ємом. Його висота більше 83 метрів, а об'єм - понад 1487 кубічних метрів.",
"Рослини можуть \"рухатися\": Наприклад, мимоза чутлива до торкання і може згорнутися при дотику, а соняшник рухається вдень, слідуючи за сонцем.",
"Незвичайні засоби поширення насіння: Деякі рослини використовують неординарні способи поширення насіння. Наприклад, баллісти розтріскують свої коробочки, викидаючи насіння на великі відстані.",
"Дерева \"спілкуються\" між собою: Дослідження показують, що дерева можуть обмінюватися хімічними сигналами через коріння, сповіщаючи про загрозу від хижаків чи інших стресових умов.",
"Найбільша квітка: Рафлезія арнольді - найбільша квітка у світі. Діаметр її квітки може сягати 1 метра, а вага - понад 10 кг.",
"Рослини можуть вирощувати нові особини з частин свого тіла: Багато рослин можуть відновлювати свої клони з вегетативних органів, таких як корені чи стебла.",
"Кращий \"смаковий виробник\": Шафран вважається однією з найдорожчих рослин на світі. Для виробництва одного кілограма шафрану потрібно зібрати близько 150 000 квітів.",
"Медові рослини: Багато рослин  виробляють нектар, який пізніше бджоли використовують для виробництва меду. Серед таких рослин - липа, акація, соняшник та інші.",
"Неймовірна тривалість життя: Деякі види рослин можуть жити дуже довго. Наприклад, дерево Бристлекон зі США може досягати віку більше 5 000 років."
];

// Функція для випадкового вибору елемента з масиву
function getRandomInfo() {
    var randomIndex = Math.floor(Math.random() * dailyInfo.length);
    return dailyInfo[randomIndex];
}